In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
arr1=np.array([10,20,30,40])
arr2=pd.Series(arr1)
print(arr2)

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
s=pd.Series([20,30,100,300],index=['a','b','c','d'])
print(s)

a     20
b     30
c    100
d    300
dtype: int64

In [8]:
# creating a dataframe from a dictionary
data={"Name":["saumya","suman","kusum","anshu"],
      "Age":[22,23,60,88]}
df=pd.DataFrame(data)
print(df)

     Name  Age
0  saumya   22
1   suman   23
2   kusum   60
3   anshu   88

In [9]:
df["city"]="mumbai"
df

     Name  Age    city
0  saumya   22  mumbai
1   suman   23  mumbai
2   kusum   60  mumbai
3   anshu   88  mumbai

In [11]:
df.drop("city",axis=1,inplace=True)
df

     Name  Age
0  saumya   22
1   suman   23
2   kusum   60
3   anshu   88